Revit 2024 API
FilterCategoryRule.GetCategories Method
 Gets the rule's categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ICollection<ElementId> GetCategories()
Visual Basic
Public Function GetCategories As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetCategories()
See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace